In [1]:
import pandas as pd
import numpy as np

# Creando un DataFrame

In [2]:
df = pd.read_csv('../Mastermind/mastermind.csv') #Por temas de doocumentación se asocia df a dataframe

In [4]:
df

   Unnamed: 0          nombre         especialidad  edad  visitas sexo
0           0       SFDX Show             Hardware    30   130855    H
1           1     Sara Nogark     Edición de vídeo    29   114175    M
2           2    Nate Gentile         Programación    31   142545    H
3           3       Bettatech         Programación    31   149462    H
4           4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5           5      Edgar Pons             Robótica    29   143620    H
6           6         s4vitar              Hacking    28   132567    H

Como podemos ver, nos genera por defecto una columna al principio de la izquierda pero nosotros ya contamos en el caso de este dataset csv con una columna indice, así que le podemos indicar cual queremos que sea el indice de la siguiente manera:

In [4]:
df = pd.read_csv('../Mastermind/mastermind.csv', index_col=[0]) 
# aquí al indicarle el 0, le tratamos de decir que agarre la primera columna
#Otra manera sería con nombre de la columna, un ejemplo es este:

# df = pd.read_csv('../Mastermind/mastermind.csv', index_col="nombre")

In [5]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

 Pandas asocia cada columna como un array, por ende podemos manipularlas y acceder a ellas

In [36]:
df["especialidad"]

0               Hardware
1       Edición de vídeo
2           Programación
3           Programación
4    Sistemas Operativos
5               Robótica
6                Hacking
Name: especialidad, dtype: object

Aquí podemos ver que el tipo de la columna a como está asociada a panda

In [37]:
type(df["especialidad"])

pandas.core.series.Series

Desde un diccionario

Aquí estamos poniendolo como lista para ver cómo mostrar la lista directa, no como arriba con el puro data

In [38]:
list(df["especialidad"])

['Hardware',
 'Edición de vídeo',
 'Programación',
 'Programación',
 'Sistemas Operativos',
 'Robótica',
 'Hacking']

In [39]:
#recuerda que puedes saber lo largo con len
len(list(df["especialidad"]))

7

In [40]:
datos = {"nombre": ["SDFX Show", "Sara Nogark", "Nate Gentille", "Bettatech", "Antonio Sarosi", "Edfar Pons",
        "s4vitar"],
         "especialidad": list(df["especialidad"]),
         "edad": [np.random.randint(28, 31) for i in range(len(df["nombre"]))],
         "visitas": [np.random.randint(100000, 150000) for i in range(len(df["nombre"]))]
        }

In [41]:
df_inventado = pd.DataFrame(datos)
#Aquí andamos asignando esos datos desde un diccionario como data frame

In [42]:
df_inventado

           nombre         especialidad  edad  visitas
0       SDFX Show             Hardware    30   107947
1     Sara Nogark     Edición de vídeo    28   148880
2   Nate Gentille         Programación    30   143192
3       Bettatech         Programación    29   141575
4  Antonio Sarosi  Sistemas Operativos    28   105647
5      Edfar Pons             Robótica    28   138027
6         s4vitar              Hacking    28   137135

In [43]:
df_inventado["sexo"] = ["H", "M", "H", "H", "H", "H", "H"]

In [44]:
df_inventado

           nombre         especialidad  edad  visitas sexo
0       SDFX Show             Hardware    30   107947    H
1     Sara Nogark     Edición de vídeo    28   148880    M
2   Nate Gentille         Programación    30   143192    H
3       Bettatech         Programación    29   141575    H
4  Antonio Sarosi  Sistemas Operativos    28   105647    H
5      Edfar Pons             Robótica    28   138027    H
6         s4vitar              Hacking    28   137135    H

Como vimos, pudimos añadirle una columna aparte nosotros al data frame ya creado

# Explorando un DataFrame

In [45]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

## df.head()

Este nos trae los primeros valores, podemos igual indicarle cuantos queremos

In [46]:
df.head()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [47]:
df.head(2)

        nombre      especialidad  edad  visitas sexo
0    SFDX Show          Hardware    30   130855    H
1  Sara Nogark  Edición de vídeo    29   114175    M

## df.tail()

Este nos trae los ultimos valores, podemos igual indicarle cuantos queremos

In [48]:
df.tail()

           nombre         especialidad  edad  visitas sexo
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [49]:
df.tail(2)

       nombre especialidad  edad  visitas sexo
5  Edgar Pons     Robótica    29   143620    H
6     s4vitar      Hacking    28   132567    H

## df.sample()

Este nos trae un parametro de muestra, solo para ver cómo es la data, podemos igual indicarle cuantos queremos

In [50]:
df.sample()

      nombre  especialidad  edad  visitas sexo
3  Bettatech  Programación    31   149462    H

In [51]:
df.sample(2)

        nombre      especialidad  edad  visitas sexo
1  Sara Nogark  Edición de vídeo    29   114175    M
6      s4vitar           Hacking    28   132567    H

## df.info()

Nos da un resumen de nuestro dataset

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombre        7 non-null      object
 1   especialidad  7 non-null      object
 2   edad          7 non-null      int64
 3   visitas       7 non-null      int64
 4   sexo          7 non-null      object
dtypes: int64(2), object(3)
memory usage: 336.0+ bytes

## df.describe()

 Nos da info de de los valores numericos que tenemos

In [53]:
df.describe()

            edad        visitas
count   7.000000       7.000000
mean   29.428571  135033.142857
std     1.272418   11590.990631
min    28.000000  114175.000000
25%    28.500000  131431.500000
50%    29.000000  132567.000000
75%    30.500000  143082.500000
max    31.000000  149462.000000

Aquí podemos detallar en donde quiero que busque exactamente

In [54]:
df.describe()["edad"]["max"]

31.0

## df.shape

Mostrandonos la forma del data frame

In [55]:
df.shape

(7, 5)

## df.columns

Con esto podemos acceder a las columnas y a su vez modificarlas

In [58]:
df.sample()

      nombre  especialidad  viejo  visitas sexo
3  Bettatech  Programación     31   149462    H

In [57]:
df.columns = ["nombre", "especialidad", "viejo", "visitas", "sexo"]
#aquí cambiamos la columna edad por viejo
#Recuerda quitar las columnas que no te sirvan, o terminará saliendote error por no coincidir el tamaño

In [59]:
df.columns = ["nombre", "especialidad", "edad", "visitas", "sexo"]

In [60]:
df.columns

Index(['nombre', 'especialidad', 'edad', 'visitas', 'sexo'], dtype='object')

## df.index

In [62]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

# Selección de elementos (Subset)

## Acceso mediante etiquetas

In [63]:
df.head()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

Queremos saber la especialidad de Nate, ¿cómo le haríamos?

In [65]:
df["especialidad"][2]

'Programación'

Bien, pero esto es suponiendo que sabemos el indice, pero si tenemos un data frame de muuuchas filas, habrá de hacer otra cosa, por ejemplo:

In [66]:
df["nombre"] == "Nate Gentile" #Bien, con esto sabes como encontrar el indice

0    False
1    False
2     True
3    False
4    False
5    False
6    False
Name: nombre, dtype: bool

In [67]:
df[df["nombre"] == "Nate Gentile"] #Aquí ya estamos trayendo el df que cumple con el requisito

         nombre  especialidad  edad  visitas sexo
2  Nate Gentile  Programación    31   142545    H

In [71]:
df[ df["nombre"] == "Nate Gentile"] ["especialidad"] #Aquí solo lo que busco

2    Programación
Name: especialidad, dtype: object

Aquí más ejemplos de cómo jalaría

In [72]:
df[ df["edad"] == 29]

        nombre      especialidad  edad  visitas sexo
1  Sara Nogark  Edición de vídeo    29   114175    M
5   Edgar Pons          Robótica    29   143620    H

In [73]:
df[ df["edad"] == 29] ["nombre"]

1    Sara Nogark
5     Edgar Pons
Name: nombre, dtype: object

df[columna][fila]

In [79]:
mas_viejos = df[df["edad"] == 31] ["nombre"]

In [80]:
mas_viejos

2    Nate Gentile
3       Bettatech
Name: nombre, dtype: object

## df.iloc[]

df.iloc[indice_fila,indice_columna]

In [6]:
df.head(5)

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [7]:
df.iloc[0,0]

'SFDX Show'

In [8]:
df.iloc[3,2]

31

Aquí estamos iterando par poder pedir que nos traiga un rango de columnas de una misma fila

In [10]:
df.iloc[2,0:2]

nombre          Nate Gentile
especialidad    Programación
Name: 2, dtype: object

## df.loc

df.loc[etiqueta_indice, etiqueta_columna]

Este se trata como un tipo hermano de iloc

In [13]:
df.head()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H

In [16]:
df.loc[2, "especialidad"]

'Programación'

aquí le estoy pidiendo el rango de lo que necesito

In [17]:
df.loc[2, "especialidad":"visitas"]

especialidad    Programación
edad                      31
visitas               142545
Name: 2, dtype: object

Si pones los 2 puntos pero no le dejas nada dicho, entenderá que quieres desde lo que marcaste inicio hasta el final

In [18]:
df.loc[2, "especialidad":]

especialidad    Programación
edad                      31
visitas               142545
sexo                       H
Name: 2, dtype: object

De igual manera al revés, si poner los dos puntos sin nada y luego el final, te traerá desde el principio hasta ese limite

In [19]:
df.loc[2, : "edad"]

nombre          Nate Gentile
especialidad    Programación
edad                      31
Name: 2, dtype: object

Aquí estamos comparando si estamos realizando lo mismo y en efecto, es lo mismo

In [20]:
df.iloc[2,0:2] == df.loc[2, "nombre" : "especialidad"]

nombre          True
especialidad    True
Name: 2, dtype: bool